<?php
return [
    // +----------------------------------------------------------------------
    // | 基础配置
    // +----------------------------------------------------------------------
    'debug'                        => true, // 是否开启调试
    'trace'                        => true, // 是否显示页面Trace信息
    'tag_trans'                    => false, //是否开启标签翻译功能
    'app_debug'                    => true, // app接口调试模式
    'error_log'                    => true, // 错误日志保存 true保存 false不保存

    'ststic'                       => URL . '/ststic',
    'vendor'                       => URL . '/vendor',
    'uploadfile'                   => URL . '/uploadfile/', // URL . '/uploadfile/',
    'imgUrl'                       => URL, // URL,
    'auth_key'                     => 'QGa9h95r9Q5dYsnpsPb9', //助手函数auth密钥 用于可逆加密

    // +----------------------------------------------------------------------
    // | 项目结构层数配置
    // | level
    // |    ture:开启项目结构
    // |    false:关闭项目结构目录
    // | 关闭后取SCRIPT_NAME 最后一个为Action 倒数第二个为Controller 参数/s区分
    // +----------------------------------------------------------------------

    'route'                        => [
        'level'      => 4, // 项目结构层数数量
        'open_level' => false,
        'open_route' => true, // 是否开启路由转换功能 true开启 false关闭
        'type'       => 'sqlite', // 保存类型
    ],

    // +----------------------------------------------------------------------
    // | Cookie配置
    // +----------------------------------------------------------------------

    'cookie'                       => [
        // Cookie 作用域
        'domain' => '',
        // Cookie 作用路径
        'path'   => '/',
        // Cookie 前缀，同一域名下安装多套系统时，请修改Cookie前缀
        'prefix' => 'dh_',
        // Cookie 保存时间
        'expire' => 0,
        // Cookie 内容加密
        'auth'   => true,
    ],

    // +----------------------------------------------------------------------
    // | 缓存配置
    // +----------------------------------------------------------------------

    'cache'                        => [
        // 类型
        'type' => 'File',
        'dir'  => DATA_CACHE_PATH,
    ],

    // +----------------------------------------------------------------------
    // | 视图模板替换字符串
    // +----------------------------------------------------------------------

    'view_replace_str'             => [
        '__PUBLIC__' => '',

    ],

    // +----------------------------------------------------------------------
    // | CORS配置
    // +----------------------------------------------------------------------
    'cores'                        => [
        // 开启状态
        'open'        => false,
        // 允许请求来源 多个来源请用数组表示
        'origin'      => '*',
        // GET,POST,PUT,DELETE
        'methods'     => ['GET', 'POST'],
        // 秒
        'maxAge'      => 1800,
        // 携带证书式访问保存cookie [当值为ture时origin不能为*]
        'credentials' => false,
    ],

    // +----------------------------------------------------------------------
    // | 磁盘容量检测
    // +----------------------------------------------------------------------

    'check_disk'                   => true, //是否开启容量检测
    'disk_space'                   => 0.1, //预警容量阀值G单位 发送邮箱提示

    // +----------------------------------------------------------------------
    // | 邮件发送配置
    // +----------------------------------------------------------------------

    'send_debug_mail'              => true, //错误信息是否发送邮箱
    'send_mail'                    => '350375092@qq.com', //接收邮箱账户

    // +----------------------------------------------------------------------
    // | 云屋直播
    // +----------------------------------------------------------------------

    'yunwu_key'                    => '15923882847',
    'yunwu_secret'                 => md5('123456'),
    'yunwu_api_key'                => md5('220762'), //加密企业ID

    // +----------------------------------------------------------------------
    // | 快递鸟参数配置
    // +----------------------------------------------------------------------

    'kdniao_id'                    => '1443142',
    'kdniao_key'                   => 'a167ad4c-9384-4df2-a20d-be421d4eb633',

    // +----------------------------------------------------------------------
    // | 百度翻译api
    // +----------------------------------------------------------------------

    'baidu_trans_appid'            => '20170926000085221',
    'baidu_trans_key'              => 'dEmcRIqvTsUWa1greRa4',

    // +----------------------------------------------------------------------
    // | 淘宝即时通讯API
    // +----------------------------------------------------------------------

    'taobao_key'                   => '24781173',
    'taobao_secret'                => '440456bd39cf4d66bd9ffe70dae68c6d',

    // +----------------------------------------------------------------------
    // | 阿里大鱼短信设置
    // +----------------------------------------------------------------------

    'ALIDAYU_SENDSMS_APPKEY'       => 'LTAIvLB5vHMUTnHm',
    'ALIDAYU_SENDSMS_APPSECRETKEY' => 'WRcmUI5JjXggJELxeNG2r6C1u7gWhQ',

    // +----------------------------------------------------------------------
    // | 阿里云OSS配置
    // +----------------------------------------------------------------------

    'OSS_ENDPOINT'                 => 'oss-cn-beijing.aliyuncs.com', // OSS数据中心访问域名
    'OSS_ACCESS_KEY'               => 'LTAIEaOBq4Yt6GsS', // OSS获得的AccessKeyId
    'OSS_ACCESS_SECRET'            => 'h3yIJYAIIJ4XKXK94qHOTC2F2DtYgn', // OSS获得的AccessKeySecret
    'OSS_BUCKET'                   => 'jyjt', // OSS存储空间名称
    'OSS_URL'                      => 'http://jyjt.oss-cn-beijing.aliyuncs.com', // 外部请求URL
    'IMG_URL_TYPE'                 => 'OSS', // 调用图片模式

    // +----------------------------------------------------------------------
    // | 微信api
    // +----------------------------------------------------------------------

    'weixin_appid'                 => 'wxeec81ef588a9214a',
    'weixin_secret'                => '1c326927e93070e1d4f4efbfb17cfb6f',

    // +----------------------------------------------------------------------
    // | 微信小程序
    // +----------------------------------------------------------------------

    'wxs_appid'                    => 'wx095d8aac10d20269', //wxe0d222cdc04d130a
    'wxs_secret'                   => '13abf6c2eb59fd490e47ea1fd475e142', //598e8c2585564ce2d3979b45c1014dd5

];
