<?php
return [
    // +----------------------------------------------------------------------
    // | 数据库信息
    // +----------------------------------------------------------------------
    'dbConfig' => [
        [
            'type'      => 'mysql', // 数据库类型
            'host'      => '119.28.77.247', // 服务器地址
            'name'      => 'moershi', // 数据库名
            'user'      => 'siyue', // 用户名
            'pwd'       => 'siyue1q2w3e4r', // 密
            'prefix'    => 'dh_', // 数据库表前缀
            'port'      => '3306', // 端口
            'dsn'       => '',
            'params'    => '',
            'charset'   => 'utf8mb4',
            'save_log'  => true, //是否开启sql日志保存
            'error_log' => true, //是否开启错误Sql保存
            'slow_log'  => true, //是否开启慢sql日志记录
            'slow_time' => 5, //查询时间超过多少秒记录日志
        ],
    ],
];
