var classidList = [
 {'':'-街道/镇-','subList':{'':'-社区/村-'}},
 { '小龙坎街道': '小龙坎街道', 'subList': { '龙泉路社区': '龙泉路社区', '解放坡社区': '解放坡社区', '嘉福苑社区': '嘉福苑社区', '嘉新社区': '嘉新社区', '康宁村社区': '康宁村社区', '新村路社区': '新村路社区', '快乐里社区': '快乐里社区', '黄桷湾社区': '黄桷湾社区'} },
 { '沙坪坝街道': '沙坪坝街道', 'subList': { '欣阳社区': '欣阳社区', '一心村社区': '一心村社区', '沙正街社区': '沙正街社区', '沙北街社区': '沙北街社区', '建工村社区': '建工村社区', '劳动路社区': '劳动路社区', '饮水村社区': '饮水村社区', '中渡口社区': '中渡口社区', '新华村社区': '新华村社区', '松林坡社区': '松林坡社区'} },
 { '渝碚路街道': '渝碚路街道', 'subList': { '杨梨路社区': '杨梨路社区', '杨公桥社区': '杨公桥社区', '白鹤岭社区': '白鹤岭社区', '沙杨路社区': '沙杨路社区', '陈家湾社区': '陈家湾社区', '南友村社区': '南友村社区', '五四村社区': '五四村社区', '沙铁村社区': '沙铁村社区', '站东路社区': '站东路社区', '双巷子社区': '双巷子社区', '沙南街社区': '沙南街社区', '汉渝路社区': '汉渝路社区', '新体村社区': '新体村社区', '四方井社区': '四方井社区'} },
 { '磁器口街道': '磁器口街道', 'subList': { '金碧正街社区': '金碧正街社区', '磁器口正街社区': '磁器口正街社区', '金沙正街社区': '金沙正街社区', '凤凰山社区': '凤凰山社区', '磁南街社区': '磁南街社区'} },
 { '童家桥街道': '童家桥街道', 'subList': { '童家桥社区': '童家桥社区', '五灵观社区': '五灵观社区', '川外村社区': '川外村社区', '政法村社区': '政法村社区', '壮志路社区': '壮志路社区', '和睦村社区': '和睦村社区'} },
 { '石井坡街道': '石井坡街道', 'subList': { '和平山社区': '和平山社区', '大河沟社区': '大河沟社区', '建设坡社区': '建设坡社区', '前进坡社区': '前进坡社区', '光荣坡社区': '光荣坡社区', '老双碑社区': '老双碑社区', '中心湾社区': '中心湾社区', '团结坝社区': '团结坝社区', '远祖桥社区': '远祖桥社区'} },
 { '詹家溪街道': '詹家溪街道', 'subList': { '双碑街社区': '双碑街社区', '自由村社区': '自由村社区', '上堆金村社区': '上堆金村社区', '下堆金村社区': '下堆金村社区', '枝元村社区': '枝元村社区', '勤居村社区': '勤居村社区', '大石村社区': '大石村社区'} },
 //{ '井口街道 ': '井口街道 ', 'subList': { '经济桥社区': '经济桥社区', '果园社区': '果园社区', '松堡社区': '松堡社区', '柏杨社区': '柏杨社区', '江家院社区': '江家院社区'} },
// { '歌乐山街道': '歌乐山街道', 'subList': { '大土村社区': '大土村社区', '高店子社区': '高店子社区', '矿山坡社区': '矿山坡社区'} },
 { '山洞街道': '山洞街道', 'subList': { '山洞路社区': '山洞路社区', '平正村社区': '平正村社区', '林园社区': '林园社区'} },
 { '新桥街道': '新桥街道', 'subList': { '新桥社区': '新桥社区', '凤鸣山社区': '凤鸣山社区', '朝阳山社区': '朝阳山社区', '高滩岩社区': '高滩岩社区', '上桥社区': '上桥社区', '上桥煤园社区': '上桥煤园社区', '清水溪社区': '清水溪社区', '张家湾社区': '张家湾社区'} },
 { '天星桥街道': '天星桥街道', 'subList': { '石碾盘社区': '石碾盘社区', '小正街社区': '小正街社区', '洪逸新村社区': '洪逸新村社区', '天星桥社区': '天星桥社区', '晒光坪社区': '晒光坪社区', '柑子村社区': '柑子村社区', '天正街社区': '天正街社区', '都市花园社区': '都市花园社区', '红槽房社区': '红槽房社区', '梨树湾社区': '梨树湾社区'} },
 { '土湾街道': '土湾街道', 'subList': { '羊角堡社区': '羊角堡社区', '民主村社区': '民主村社区', '新生村社区': '新生村社区', '模范村社区': '模范村社区', '新建二村社区': '新建二村社区', '京华院社区': '京华院社区', '工人村社区': '工人村社区', '农场湾社区': '农场湾社区'} },
 { '覃家岗街道': '覃家岗街道', 'subList': { '新立社区': '新立社区', '新鸣社区': '新鸣社区', '梨园社区': '梨园社区', '新立社区': '新立社区', '梨树湾社区': '梨树湾社区', '上桥社区': '上桥社区', '新桥社区': '新桥社区', '童家桥社区': '童家桥社区'} },
 { '大学城':'大学城','subList':{}},
 { '井口镇': '井口镇', 'subList': { '双碑村': '双碑村', '南溪村': '南溪村', '井口村': '井口村', '二塘村': '二塘村'} },
 { '歌乐山镇': '歌乐山镇', 'subList': { '金刚村': '金刚村', '歌乐山村': '歌乐山村', '天池村': '天池村', '新开寺村': '新开寺村', '山洞村': '山洞村'} },
 { '青木关镇': '青木关镇', 'subList': { '青云街社区': '青云街社区', '新青路社区': '新青路社区', '管家桥村': '管家桥村', '石碾桥村': '石碾桥村', '青木湖村': '青木湖村', '四楞碑村': '四楞碑村', '关口村': '关口村'} },
 { '凤凰镇': '凤凰镇', 'subList': { '社区社区': '社区社区', '皂角村': '皂角村', '凤凰桥村': '凤凰桥村', '八字桥村': '八字桥村', '胡南坝村': '胡南坝村', '杨家庙村': '杨家庙村', '五福村': '五福村', '威灵寺村': '威灵寺村'} },
 { '回龙坝镇': '回龙坝镇', 'subList': { '社区社区': '社区社区', '大桥村': '大桥村', '水沟村': '水沟村', '梁滩桥村': '梁滩桥村', '真武山村': '真武山村', '保龙村': '保龙村', '回龙坝村': '回龙坝村', '五云山村': '五云山村', '四龙村': '四龙村', '西溪桥村': '西溪桥村', '青龙庙村': '青龙庙村'} },
 { '陈家桥镇': '陈家桥镇', 'subList': { '桥南社区': '桥南社区', '桥北社区': '桥北社区', '香炉山村': '香炉山村', '中峰寺村': '中峰寺村', '双佛村': '双佛村', '石滩村': '石滩村', '白鹤村': '白鹤村', '官房寺村': '官房寺村', '丰文山村': '丰文山村', '陈家桥村': '陈家桥村', '三河村': '三河村', '天马山村': '天马山村', '万宝村': '万宝村'} },
 { '曾家镇': '曾家镇', 'subList': { '社区社区': '社区社区', '龙荫社区': '龙荫社区', '福龙村': '福龙村', '汤家村': '汤家村', '龙阴村': '龙阴村', '双龙村': '双龙村', '农安村': '农安村', '白林村': '白林村', '虎峰山村': '虎峰山村', '清明村': '清明村', '福来村': '福来村', '五里冲村': '五里冲村'} },
 { '虎溪镇': '虎溪镇', 'subList': { '虎兴社区': '虎兴社区', '建新村': '建新村', '沙石村': '沙石村', '花马村': '花马村', '复兴寺村': '复兴寺村', '伍家沟村': '伍家沟村', '大田保村': '大田保村', '石牛岗村': '石牛岗村'} },
 { '西永镇': '西永镇', 'subList': { '永兴社区': '永兴社区', '西永村': '西永村', '中柱村': '中柱村', '童善桥村': '童善桥村', '香蕉园村': '香蕉园村', '兴隆沟村': '兴隆沟村', '冷水沟村': '冷水沟村'} },
 { '土主镇': '土主镇', 'subList': { '土主社区': '土主社区', '明珠山村': '明珠山村', '观音岩村': '观音岩村', '田坝村': '田坝村', '向家坪村': '向家坪村', '四塘村': '四塘村', '五一村': '五一村', '盐井河村': '盐井河村', '力量村': '力量村', '三圣宫村': '三圣宫村'} },
 { '中梁镇': '中梁镇', 'subList': { '新店子社区': '新店子社区', '茅山峡村': '茅山峡村', '石院村': '石院村', '龙泉村': '龙泉村', '庆丰山村': '庆丰山村', '永宁寺村': '永宁寺村', '新发村': '新发村'} },
 { '联芳园区镇': '联芳园区镇', 'subList': { '学堂堡社区': '学堂堡社区', '联芳桥社区': '联芳桥社区', '圣泉社区': '圣泉社区', '联芳村': '联芳村'} }
 ];

//设置小类所对应的Map值;  
function setSubClass(province, subClassid) {
    var subClassMap;
    for (i = 0; i < classidList.length; i++) {
        var classMap = classidList[i];
        for (var prop in classMap) {
            if (prop == province) {
                subClassMap = classMap['subList'];
            }
        }
    }
    setSelectOption(subClassid, subClassMap, '-社区/村-');
}
//根据大类的改变，相应小类进行初始化。  
function setSelectOption(selectObj, optionList, firstOption, selected) {
	if (typeof selectObj != 'object') {
        selectObj = document.getElementById(selectObj);
    }
    removeOptions(selectObj);
    var start = 0;
    if (firstOption) {
        selectObj.options[0] = new Option(firstOption, '');
        start++;
    }
    for (var prop in optionList) {
        selectObj.options[start] = new Option(optionList[prop], prop);
        if (selected == prop) {
            selectObj.options[start].selected = true;
        }
        start++;
    }
}
//清除子类选项  
function removeOptions(selectObj) {
    if (typeof selectObj != 'object') {
        selectObj = document.getElementById(selectObj);
    }
    var len = selectObj.options.length;
    for (var i = 0; i < len; i++) {
        selectObj.options[0] = null;
    }
}

//初始化  
function initDropList(mainClassid, subClassid) {
    var mainClassid = document.getElementById(mainClassid);
    //读取大类并添加到大类选择中  
    for (iter = 0; iter < classidList.length; iter++) {
        var classMap = classidList[iter];
        for (var prop in classMap) {
            if (prop != 'subList') {
                mainClassid.options.add(new Option(classMap[prop], prop));
				if (iter == 0){	setSubClass(classMap[prop],subClassid); }
            }
        }
    }
}